{"id":"5330b417-cbc7-41ad-af2f-8e38501f8490","rule_id":"a4b0f168-3763-4ede-b118-c9b0da555033","name":"Failed Logon Burst (T1110)","immutable":false,"rule_source":{"type":"internal"},"version":1,"revision":2,"updated_at":"2025-11-11T06:47:36.756Z","updated_by":"2276008745","created_at":"2025-11-11T05:14:59.720Z","created_by":"2276008745","enabled":true,"interval":"5m","from":"now-6m","to":"now","description":"Detects repeated failed Windows logon attempts indicative of brute-force or password-spraying activity.","tags":[],"author":[],"license":"","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1110","name":"Brute Force","reference":"https://attack.mitre.org/techniques/T1110/","subtechnique":[]}]}],"related_integrations":[],"required_fields":[],"setup":"","false_positives":[],"references":[],"risk_score":75,"risk_score_mapping":[],"severity":"high","severity_mapping":[],"output_index":"","max_signals":100,"exceptions_list":[],"actions":[],"meta":{"kibana_siem_app_url":"https://02cb50714e214eddbdcdee0c84f9d5e1.us-central1.gcp.cloud.es.io/app/security"},"type":"threshold","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"data_stream.dataset: \"system.security\" AND winlog.event_id: \"4625\" ","filters":[],"threshold":{"field":["user.name"],"value":5,"cardinality":[]}}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
